[NoCoverage] BlockStatement
src/app/global-error.tsx:12:19
 }>
 
 export default function GlobalError({ error }: ErrorProps): ReactElement {
-  useEffect(() => {
-    captureException(error)
-  }, [error])
+  useEffect(() => {}, [error])
 
   return (

[NoCoverage] ArrayDeclaration
src/app/global-error.tsx:14:6
 export default function GlobalError({ error }: ErrorProps): ReactElement {
   useEffect(() => {
     captureException(error)
-  }, [error])
+  }, [])
 
   return (
