[NoCoverage] BlockStatement
src/app/sentry/page.tsx:7:34
 import { ReactElement } from 'react'
 
 export default function PageSentry(): ReactElement {
-  async function generateError() {
-    await startSpan({
-      name: 'Example Frontend Span',
-      op: 'test',
-    }, async () => {
-      const res = await fetch('/api/sentry')
-
-      if (!res.ok) {
-        throw new Error('Erreur explicite du frontend')
-      }
-    })
-  }
+  async function generateError() {}
 
   return (

[NoCoverage] BlockStatement
src/app/sentry/page.tsx:11:20
     await startSpan({
       name: 'Example Frontend Span',
       op: 'test',
-    }, async () => {
-      const res = await fetch('/api/sentry')
-
-      if (!res.ok) {
-        throw new Error('Erreur explicite du frontend')
-      }
-    })
+    }, async () => {})
   }
 

[NoCoverage] ConditionalExpression
src/app/sentry/page.tsx:14:11
     }, async () => {
       const res = await fetch('/api/sentry')
 
-      if (!res.ok) {
+      if (false) {
         throw new Error('Erreur explicite du frontend')
       }

[NoCoverage] BlockStatement
src/app/sentry/page.tsx:14:20
     }, async () => {
       const res = await fetch('/api/sentry')
 
-      if (!res.ok) {
-        throw new Error('Erreur explicite du frontend')
-      }
+      if (!res.ok) {}
     })
   }

[NoCoverage] StringLiteral
src/app/sentry/page.tsx:15:25
       const res = await fetch('/api/sentry')
 
       if (!res.ok) {
-        throw new Error('Erreur explicite du frontend')
+        throw new Error("")
       }
     })
