[NoCoverage] StringLiteral
src/app/not-found.tsx:8:10
 import LienExterne from '@/components/shared/LienExterne/LienExterne'
 
 export const metadata: Metadata = {
-  title: 'Page non trouvée',
+  title: "",
 }
 
