[NoCoverage] StringLiteral
src/app/page.tsx:4:15
 import { Metadata } from 'next'
 import { ReactElement } from 'react'
 
-const title = 'Suite gestionnaire numérique'
+const title = ""
 export const metadata: Metadata = {
   title,
