[Survived] StringLiteral
components/shared/LienExterne/LienExterne.tsx:9:61
   title: string
 }>>
 
-export default function LienExterne({ children, className = '', href, title }: LienExterneProps): ReactElement {
+export default function LienExterne({ children, className = "Stryker was here!", href, title }: LienExterneProps): ReactElement {
   return (
     <a

[Killed] StringLiteral
components/shared/LienExterne/LienExterne.tsx:16:14
       href={href}
       rel="noopener external noreferrer"
       target="_blank"
-      title={`${title} - nouvelle fenêtre`}
+      title={``}
     >
       {children}
killedBy: pied de page afficher le pied de page
statusReason: Il manque soit le target, soit le rel ou soit le title
